# -*- coding: utf-8 -*-

import requests
import json
from collections import defaultdict
import argparse
import re

parser = argparse.ArgumentParser(description='List certain kanjis by WaniKani levels.')
parser.add_argument('kanji_list', metavar='L', type=str, help='Name of the list wanted. Current ones are n5, n4, n3, n2, n1, genki, tobira_pre and tobira.')

args = parser.parse_args()

file = open("api_key","r")
api_key = file.read()
file.close()

file = open("api2_key","r")
api2_key = file.read()
file.close()

headers = {'Authorization': 'Bearer ' + api2_key}

n5_kanji = u"日一国人年大十二本中長出三時行見月後前生五間上東四今金九入学高円子外八六下来気小七山話女北午百書先名川千水半男西電校語土木聞食車何南万毎白天母火右読友左休父雨"
n4_kanji = u"会同事自社発者地業方新場員立開手力問代明動京目通言理体田主題意不作用度強公持野以思家世多正安院心界教文元重近考画海売知道集別物使品計死特私始朝運終台広住真有口少町料工建空急止送切転研足究楽起着店病質待試族銀早映親験英医仕去味写字答夜音注帰古歌買悪図週室歩風紙黒花春赤青館屋色走秋夏習駅洋旅服夕借曜飲肉貸堂鳥飯勉冬昼茶弟牛魚兄犬妹姉漢"
n3_kanji = u"政議民連対部合市内相定回選米実関決全表戦経最現調化当約首法性要制治務成期取都和機平加受続進数記初指権支産点報済活原共得解交資予向際勝面告反判認参利組信在件側任引求所次昨論官増係感情投示変打直両式確果容必演歳争談能位置流格疑過局放常状球職与供役構割費付由説難優夫収断石違消神番規術備宅害配警育席訪乗残想声念助労例然限追商葉伝働形景落好退頭負渡失差末守若種美命福望非観察段横深申様財港識呼達良候程満敗値突光路科積他処太客否師登易速存飛殺号単座破除完降責捕危給苦迎園具辞因馬愛富彼未舞亡冷適婦寄込顔類余王返妻背熱宿薬険頼覚船途許抜便留罪努精散静婚喜浮絶幸押倒等老曲払庭徒勤遅居雑招困欠更刻賛抱犯恐息遠戻願絵越欲痛笑互束似列探逃遊迷夢君閉緒折草暮酒悲晴掛到寝暗盗吸陽御歯忘雪吹娘誤洗慣礼窓昔貧怒祖泳杯疲皆鳴腹煙眠怖耳頂箱晩寒髪忙才靴恥偶偉猫幾"
n2_kanji = u"党協総区領県設改府査委軍団各島革村勢減再税営比防補境導副算輸述線農州武象域額欧担準賞辺造被技低復移個門課脳極含蔵量型況針専谷史階管兵接細効丸湾録省旧橋岸周材戸央券編捜竹超並療採森競介根販歴将幅般貿講林装諸劇河航鉄児禁印逆換久短油暴輪占植清倍均億圧芸署伸停爆陸玉波帯延羽固則乱普測豊厚齢囲卒略承順岩練軽了庁城患層版令角絡損募裏仏績築貨混昇池血温季星永著誌庫刊像香坂底布寺宇巨震希触依籍汚枚複郵仲栄札板骨傾届巻燃跡包駐弱紹雇替預焼簡章臓律贈照薄群秒奥詰双刺純翌快片敬悩泉皮漁荒貯硬埋柱祭袋筆訓浴童宝封胸砂塩賢腕兆床毛緑尊祝柔殿濃液衣肩零幼荷泊黄甘臣浅掃雲掘捨軟沈凍乳恋紅郊腰炭踊冊勇械菜珍卵湖喫干虫刷湯溶鉱涙匹孫鋭枝塗軒毒叫拝氷乾棒祈拾粉糸綿汗銅湿瓶咲召缶隻脂蒸肌耕鈍泥隅灯辛磨麦姓筒鼻粒詞胃畳膚机濯塔灰沸菓帽枯涼舟貝符憎皿肯燥畜挟曇滴伺"
n1_kanji = u"氏統保第結派案策基価提挙応企検藤沢裁証援施井護展態鮮視条幹独宮率衛張監環審義訴株姿閣衆評影松撃佐核整融製票渉響推請器士討攻崎督授催及憲離激摘系批郎健盟従修隊織拡故振弁就異献厳維浜遺塁邦素遣抗模雄益緊標宣昭廃伊江僚吉盛皇臨踏壊債興源儀創障継筋闘葬避司康善逮迫惑崩紀聴脱級博締救執房撤削密措志載陣我為抑幕染奈傷択秀徴弾償功拠秘拒刑塚致繰尾描鈴盤項喪伴養懸街契掲躍棄邸縮還属慮枠恵露沖緩節需射購揮充貢鹿却端賃獲郡併徹貴衝焦奪災浦析譲称納樹挑誘紛至宗促慎控智握宙俊銭渋銃操携診託撮誕侵括謝駆透津壁稲仮裂敏是排裕堅訳芝綱典賀扱顧弘看訟戒祉誉歓奏勧騒閥甲縄郷揺免既薦隣華範隠徳哲杉釈己妥威豪熊滞微隆症暫忠倉彦肝喚沿妙唱阿索誠襲懇俳柄驚麻李浩剤瀬趣陥斎貫仙慰序旬兼聖旨即柳舎偽較覇詳抵脅茂犠旗距雅飾網竜詩繁翼潟敵魅嫌斉敷擁圏酸滅罰礎腐脚潮梅尽僕桜滑孤炎賠句鋼頑鎖彩摩励縦輝蓄軸巡稼瞬砲噴誇祥牲秩帝宏唆阻泰賄撲堀菊絞縁唯膨矢耐塾漏慶猛芳懲剣彰棋丁恒揚冒之倫陳憶潜梨仁克岳概拘墓黙須偏雰遇諮狭卓亀糧簿炉牧殊殖艦輩穴奇慢鶴謀暖昌拍朗寛覆胞泣隔浄没暇肺貞靖鑑飼陰銘随烈尋稿丹啓也丘棟壌漫玄粘悟舗妊熟旭恩騰往豆遂狂岐陛緯培衰艇屈径淡抽披廷錦准暑磯奨浸剰胆繊駒虚霊帳悔諭惨虐翻墜沼据肥徐糖搭盾脈滝軌俵妨擦鯨荘諾雷漂懐勘栽拐駄添冠斜鏡聡浪亜覧詐壇勲魔酬紫曙紋卸奮欄逸涯拓眼獄尚彫穏顕巧矛垣欺釣萩粛栗愚嘉遭架鬼庶稚滋幻煮姫誓把践呈疎仰剛疾征砕謡嫁謙后嘆菌鎌巣頻琴班棚潔酷宰廊寂辰霞伏碁俗漠邪晶墨鎮洞履劣那殴娠奉憂朴亭淳怪鳩酔惜穫佳潤悼乏該赴桑桂髄虎盆晋穂壮堤飢傍疫累痴搬晃癒桐寸郭尿凶吐宴鷹賓虜陶鐘憾猪紘磁弥昆粗訂芽庄傘敦騎寧循忍怠如寮祐鵬鉛珠凝苗獣哀跳匠垂蛇澄縫僧眺亘呉凡憩媛溝恭刈睡錯伯笹穀陵霧魂弊妃舶餓窮掌麗綾臭悦刃縛暦宜盲粋辱毅轄猿弦稔窒炊洪摂飽冗桃狩朱渦紳枢碑鍛刀鼓裸猶塊旋弓幣膜扇腸槽慈楊伐駿漬糾亮墳坪紺娯椿舌羅峡俸厘峰圭醸蓮弔乙汁尼遍衡薫猟羊款閲偵喝敢胎酵憤豚遮扉硫赦窃泡瑞又慨紡恨肪扶戯伍忌濁奔斗蘭迅肖鉢朽殻享秦茅藩沙輔媒鶏禅嘱胴迭挿嵐椎絹陪剖譜郁悠淑帆暁傑楠笛玲奴錠拳翔遷拙侍尺峠篤肇渇叔雌亨堪叙酢吟逓嶺甚喬崇漆岬癖愉寅礁乃洲屯樺槙姻巌擬塀唇睦閑胡幽峻曹詠卑侮鋳抹尉槻隷禍蝶酪茎帥逝汽琢匿襟蛍蕉寡琉痢庸朋坑藍賊搾畔遼唄孔橘漱呂拷嬢苑巽杜渓翁廉謹瞳湧欣窯褒醜升殉煩巴禎劾堕租稜桟倭婿慕斐罷矯某囚魁虹鴻泌於赳漸蚊葵厄藻禄孟嫡尭嚇巳凸暢韻霜硝勅芹杏棺儒鳳馨慧愁楼彬匡眉欽薪褐賜嵯綜繕栓翠鮎榛凹艶惣蔦錬隼渚衷逐斥稀芙詔皐雛惟佑耀黛渥憧宵妄惇脩甫酌蚕嬉蒼暉頒只肢檀凱彗謄梓丑嗣叶汐絢朔伽畝抄爽黎惰蛮冴萌旺壱偲瑠允侯蒔鯉弧遥舜瑛附彪卯但綺芋茜凌皓洸毬婆緋鯛怜邑倣碧啄穣酉悌倹柚繭亦詢采紗賦眸玖弐錘諄倖痘笙侃裟洵爾耗昴銑莞伶碩宥滉晏伎朕迪綸且竣晨吏燦麿頌箇楓琳梧哉澪匁晟衿凪梢丙颯茄勺恕蕗瑚遵瞭燎虞柊侑謁斤嵩捺蓉茉袈燿誼冶栞墾勁菖旦椋叡紬胤凜亥爵脹麟莉汰瑶瑳耶椰絃丞璃奎塑昂柾熙菫諒鞠崚濫捷"
genki_kanji = u"一二三四五六七八九十百千万円時日本人月火水木金土曜上下中半山川元気天私今田女男見行食飲東西南北口出右左分先生大学外国京子小会社父母高校毎語文帰入員新聞作仕事電車休言読思次何午後前名白雨書友間家話少古知来住正年売買町長道雪立自夜朝持手紙好近明病院映画歌市所勉強有旅昔々神早起牛使働連別度赤青色物鳥料理特安飯肉悪体空港着同海昼彼代留族親切英店去急乗当音楽医者死意味注夏魚寺広転借走建地場足通供世界全部始週以考開屋方運動教室歳習主結婚集発表品字活写真歩野目的力洋服堂授業試験貸図館終宿題春秋冬花様不姉兄漢卒工研究質問多皿声茶止枚両無払心笑絶対痛最続信経台風犬重初若送幸計遅配弟妹記銀回夕黒用守末待残番駅説案内忘顔情怒変相横比化違悲調査果感答"
tobira_pre_kanji = u"女天兄矢次初車昔前秋書悪晴働一子少冬立死利近服南約校授暑意横小心出毎医返東変茶消教最新調七山手北休気図歩室計留族朝暗質九川文半会汚売事注屋送病球港業二工方古先百弟京物度重紙理番楽薬人々日台全竹忘使画待音荷終痛漢親入月右同糸来卒知後風記経着試館八不木四名考男取空思食起習答話十中止外回耳町受者拾通転結違曜予水左地肉社味若持借配週買電職万五火広多自私国英映勉院部貸題三今父末好色究夜金春員馬野遅様顔上元牛本字行花妹長昼夏高雪運歌験下六犬母守西見姉門洗家魚道練千円王生安言始雨活帰動鳥開聞口分用寺住貝学青海弱問黒間語土切世田年体赤店界料婚飯読夕化主白早何走所乗研旅宿場飲銀大友仕目有作足明便神時強寒駅"
tobira_kanji = u"島平和伝温差美選残建形的特市説決別達覚実相難性比代感表忙短晩由必要合昨発他首声集供泣両当解連念笑法直苦助呼単現組内勝成例負絶対礼向正育能彼与関係速億続在米以失敗功数増信得客流置式石査熱民急紀倍参加個反賛果済品虫丸命戦争未深閉号悲静払格効科減完登公逆低点常写真確村制満進落協位幸可原因求容算等去喜洋訪景冷区危険役省将情報独身遠並歴史各税支季節非交共指士政府過良泊植第軽光技術仲折角線側頭治枚印象然細夢氷詩想像接示池妻条件暖挙祖標束投票態責任権無期評価疑周太付希望悩豊届再貧森林緑捨"
shiru_1_kanji = u"一宅玉合事成外会造下昨般茶社終鉄噌近知食日学飯煮譲本電的予程和氏気朝多天家車手毎乗海野章奥勤部業識味出最市率分上第間備供通製漬地焼心時先始族子仕小務単聞以普都洋床準語校大度夫中報新課男人構汁長集郊住違菜藤佐物目女飲入起特"
shiru_2_kanji = u"要広済事同預店際水買計常町施見放所必請行金達団日除念捨選電持満布包的予小休徒引折定朝力速骨説朱帳家刻押房屋村取教既入部業米職役書出需掃市文理肉開留間通実地効礼品時先告姓動受単員解全銀濯印干晶製項授名式洗生校欧申土丹活込簡届具集車額鑑牙象近物巨彫売長法"
shiru_3_kanji = u"広宅各安済事店外際会判段買費類昼社所立母近忙食日学給電替企円服休訓引定連客議風親唱主押背街取教値絡来左部業当平役書比弁堂理備制便着心時情先働歌子姓仕受作属員若婦全公数整国姿百名後少準語校利中支報育男午込均操前住体返字襟回物話売海使"
shiru_4_kanji = u"要一待暇紀合養昔店外料会御済分鮭般水買茶容馴旅談商立重難近限真飛凝食握遠代工除器飯深泳側電持紅的服夕舗帯割労家主参手及道習取教機既来歩軽自打味役国出楽現最掃専梅理読型躍本余世包供喫庭漬種花足携品着時装勉働子染動単類婦増濯普英塩干竹典製門薄独洗講果生簡話度温夫中支皮売感強活両行提体古物扱飲延特仕固"
shiru_5_kanji = u"要一宅事養同園増外料娘力多採造接復帰水買方費待放終必珍噌近酒達日食団燥士泳週企技球的変社個化二休験夕気減次会交骨師家主流草屋及背野術取教機発勤自業味兵職在風乾楽現最理争残通戦用庭第種地制伸妻宿場品情勉先遊操結仕受務換豚類員以普音引空製塾後真大席報課強人激居筋題体関僚出物杯話飲競"
shiru_6_kanji = u"一内合欒支料宅際会管座寝般帰場計方麻社所代近酒顔鳥距団形日除給番年系持銀的切小引振伝加交親帯家主簿雀手及野行遣入勤自当統平在役出現砂理肉型与間通用庭本細串父油輸焼時組遊酌総過材臓奥豚作類口以婦狩捨普竹都較不生語渡東醤大醬唯活込遅均前問題体比糖菜室正離晩称囲起"
shiru_7_kanji = u"一広宅計成級枝価夢済方町格社立難形達寝団確工除給高番置譲電松技的下植小美訓紙減定伝速加会風盆帳屋簿十手及野道何乗取教付機入部自術曲統味木払出好購紀梅分月見上間純算世通検趣用庭本縮地観防制点伸妻程便品着時組先然過子法単占鉢試狭験普浴移発姿塾指床倍完来階呂生度利夫支就育活人栽範集葉住鑑合返賞珠基物山囲練具"
shiru_8_kanji = u"要一閉合事同研暗化粛会接恩座義身計方戸聞格存社終雇商立営重代近知盛寝済神団形日学表念本企布的切変和小係引気視紙折厚伝障次加関風縫張労家主年流参光屋習付章略左並業修統米直用現儀分月開観明従倒通実欠細在第種地厳圧礼装組名始働季族過佐仕来域類員示以増可数右歴店空都送経床不式大情生資欧称中新感活人精節敷誠住行体違期様応忠慣藤子物度目台畳入長特対板"
shiru_9_kanji = u"季広皇合増外領際会功採未場戸宴賃上男鯉立行金桐達句盛魚桜神代形日武士給端製年系呼竿企考的昇下和小紙定力交性天風掲労家改流運菊毎高揚江条章空部業米用基現最率分争見尊布与飾戦在本花細厳制点程水心時組午働歌動存滝占以能別公華俳発国善渉紋後意官期逆続春大度中味支徴強吹込精節件体違敗闘賞象近散欧物零死対織"
shiru_10_kanji = u"要言暇事成園外記力会賛皇義方核施放旅珍行日達願雛保非形句武器念幸電呼持餅的渋和休源列首定府速関交海議天含憲改主運棄則屋及道乗菖高揚祝曜機条入自祭湯共平兵書基楽現率分争尊福第従世通原宣戦在本地時遊界柏雑動換類員公路普数音混発国響者気三業不式民候必期語権週蒲人込政節元具重車客総九滞正物長法飾"
shiru_11_kanji = u"企考者的順守律上規与向従倒敬識定伝遠実薄違就通交圧依分頭民地興強制根為談事政傾示故廷則映反行離卒法意視存婚勝信忠泣面知大学白触業間統議味聴職部司国協"
shiru_rest_kanji = u"要撃待縄劇合袋霊璃耐昔抗外料鐘会宝飲造済恩喩被未般帯熱曲録然方聞稼皿放賃魂必談棋反臣仏金恐忘筒織真祖刻遠泣止知除勧緩周士罪念年諷慶替穣球雛的切難個誌継引可列首紙故謝抜無客交異貨説港失等色張刷憶改岸辺参雄則蕉運寒何赴教城孝州函険来漬触注火独景差共声米史直絹糸基湿儀跡塗率順粉贈見上認導碑間底演算双対趣販用読第足稲伴油妻石便尾税衆泉秋歌腐使仕伏受競勝費域褻向宗綿以潤拭確証慰割郎偶移発響送清径指琉消完式民灯北蛍愛初土校東産春蛇欧仰夫設仲週申課期極省人稽精秀狂幅葉母態車前富住幼幕返字相菜束賞科勢好八雪召杯称畳卒豆建板糾五言広齢超各席芋再伎成堂増化稚力級裏報槽夢皮義披爆貯箱到水丸町型弾所廃旅掲壇立重題低形福策忙明活非握代酢日層学器番置暇倒郷鹸構松持銀布乾紅有予程越植小美笑柿栗敷続次加性輩告催優憲蔵家誠戻晴十浅積手配背迎罰狐角街取静付牛線祝江章陣略券顧革雨穫縦業修平懲巨鳴職木役書楽飼慈柔砂約分争月残尊頃与従怒庭掛夜庄卓欠昇覧戦在例炭害抱徳進冷制輸去礼祈績心遂浄友豊働総子韓離法伸換欲拡占意試叫豪公路焼英議音整扶爪決都兼速励威鍋能薄三視評濃階父酵装猛思航生厚大温猫頭冬支暮許育琵鶴状医政惨節届居筋泊額里問経裁提当展族起回滑固履藤諦晩質目話台売練具拶幹俸飾災詣境漂宅皇粋融希良墓園是店存写内依功餞唱漢接判座犯岡玉露段康計妹核治区羽調社藁鉄雇商姉半忍緑紹貸願賛魚保神巡瑠面句給表婦煮深想穴廷絶選系鹼毎途考包万賀変殊服二君定伝府舟黄負連愚印天風含駆京娯由奉農労営恋房浴流哀桃係光屋及位隣野道習彩揚機銭衣勤左製術副統復卵寺身承紀市酒将肉断開刊県舎投林備戚実善没素館訪亭本田観甲抵琶点刺頼宿琴品時奈先緋軍遣描過結動協俗常踊婚作類員解院若此全処華格数干歴部典空軽彼塾封正祭洋暖不後少互湯掘候病紛果猟簡別室圧中味振就新宴強根画込傾両元範均徴降行鑑軒払比糖様九応象締慣転古適臨暦山利女囲援島白漫顔一邪禅漆安興事養同醬洒研記際多誕四価映値弦玩庫理維献帰悲場御容戸麻示施太聖終扱資築介溶団像近限達盆工盛后食信編武葬飯繰拳聴井電呼弔企満浪得激下納和休源験裂気挙折借関陰師親図宮襲原芸主蒼雀棄獣草閣収村打緒麦幸高任条剣既入派自体息寮影雰兵南国登出購避現庁最掃横梅文技芭律規討暑弟世供通舞亡宣普並助挨単種地厳防効茸滞渋着呂情兄門勉遊界量雑材僕識詞口旧晦快敬似詩右混竹遺俳姿況者裳隆守炊名夏耕洗準官望仮喜感語渡枠急醤度権推末悪即撲馴男庶箸為落始繁謡千海集己郊奏逆批歓塩違敗牙忠季賢健物旬述歳恵致長件特司諾命咲西答"

kanji_list = ""

if args.kanji_list == "n5":
	kanji_list = n5_kanji
elif args.kanji_list == "n4":
	kanji_list = n4_kanji
elif args.kanji_list == "n3":
	kanji_list = n3_kanji
elif args.kanji_list == "n2":
	kanji_list = n2_kanji
elif args.kanji_list == "n1":
	kanji_list = n1_kanji
elif args.kanji_list == "genki":
	kanji_list = genki_kanji
elif args.kanji_list == "tobira_pre":
	kanji_list = tobira_pre_kanji
elif args.kanji_list == "tobira":
	kanji_list = tobira_kanji
elif args.kanji_list == "shiru_1":
	kanji_list = shiru_1_kanji
elif args.kanji_list == "shiru_2":
	kanji_list = shiru_2_kanji
elif args.kanji_list == "shiru_3":
	kanji_list = shiru_3_kanji
elif args.kanji_list == "shiru_4":
	kanji_list = shiru_4_kanji
elif args.kanji_list == "shiru_5":
	kanji_list = shiru_5_kanji
elif args.kanji_list == "shiru_6":
	kanji_list = shiru_6_kanji
elif args.kanji_list == "shiru_7":
	kanji_list = shiru_7_kanji
elif args.kanji_list == "shiru_8":
	kanji_list = shiru_8_kanji
elif args.kanji_list == "shiru_9":
	kanji_list = shiru_9_kanji
elif args.kanji_list == "shiru_10":
	kanji_list = shiru_10_kanji
elif args.kanji_list == "shiru_11":
	kanji_list = shiru_11_kanji
elif args.kanji_list == "shiru_rest":
	kanji_list = shiru_rest_kanji
elif args.kanji_list == "shiru_1_semester":
	kanji_list = shiru_1_kanji + shiru_2_kanji + shiru_3_kanji + shiru_4_kanji + shiru_5_kanji + shiru_6_kanji + shiru_7_kanji + shiru_8_kanji + shiru_9_kanji + shiru_10_kanji + shiru_11_kanji	
elif args.kanji_list == "shiru_all":
	kanji_list = shiru_1_kanji + shiru_2_kanji + shiru_3_kanji + shiru_4_kanji + shiru_5_kanji + shiru_6_kanji + shiru_7_kanji + shiru_8_kanji + shiru_9_kanji + shiru_10_kanji + shiru_11_kanji + shiru_rest_kanji
else: 
	kanji_list = args.kanji_list

print("Number of kanji in this set: " + str(len(kanji_list)))

levels = ""
for i in range(1,61):
	levels += str(i) + ","
levels = levels[:-1]

kanji_by_level = {}

url = "https://api.wanikani.com/v2/subjects/?types=kanji"

next_url = True

while next_url:
	r = requests.get(url, headers=headers)
	data = r.json()
	for i in data["data"]:
		for j in kanji_list:
			if i["data"]["characters"] == j:
				kanji_list = kanji_list.replace(j,"")
				if i["data"]["level"] in kanji_by_level:
					kanji_by_level[i["data"]["level"]] += i["data"]["characters"]
				else:
					kanji_by_level[i["data"]["level"]] = i["data"]["characters"]
	if data['pages']['next_url'] != None:
		url = data['pages']['next_url']
	else:
		next_url = False

kanji_by_level = {k: kanji_by_level[k] for k in sorted(kanji_by_level)}
kanji_by_level['not yet covered'] = kanji_list

for i in kanji_by_level:
	print(str(i) + ": " + kanji_by_level[i])